app/views/posts/_post_comments.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 12
---
<% post.comments.each do |comment| %>