app/controllers/posts_controller.rb

SELECT `likes`.`post_id` FROM `likes` WHERE `likes`.`user_id` = 2
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 12 LIMIT 1
---
  def user_posts
    # finding all the posts
    post_ids = Like.user_liked_posts(params[:id])
    # Bad Code need to refactor need to find way to add 3 table like nested models
    @posts = []
    post_ids.each do |post|
      @posts << Post.find(post.post_id)