app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def user_posts
    # finding all the posts
    @user = User.find(params[:id])

INSERT INTO `likes` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES (9, 2, '2021-08-15 06:10:25.105201', '2021-08-15 06:10:25.105201')
INSERT INTO `posts` (`description`, `user_id`, `created_at`, `updated_at`) VALUES ('zfafasfas', 1, '2021-08-14 09:39:08.644045', '2021-08-14 09:39:08.644045')
---
  def post_likes
    @like = @post.likes.build(user_id: current_user.id)
    @posts = get_all_recent_posts(10)
    respond_to do |format|
      if @like.save

INSERT INTO `comments` (`body`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('xvs dsd fgsd f', 10, 2, '2021-08-17 05:09:35.781427', '2021-08-17 05:09:35.781427')
INSERT INTO `posts` (`description`, `user_id`, `created_at`, `updated_at`) VALUES ('interview 1', 2, '2021-08-15 06:14:49.000932', '2021-08-15 06:14:49.000932')
---
  def post_comments
    @comment = @post.comments.build(user_id: current_user.id)
    @comment.body = params[:body]
    @posts = get_all_recent_posts(10)
    respond_to do |format|
      if @comment.save

INSERT INTO `posts` (`description`, `user_id`, `created_at`, `updated_at`) VALUES ('zfafasfas', 1, '2021-08-14 09:39:08.644045', '2021-08-14 09:39:08.644045')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def get_user_recent_posts(user_id,size)
      user = User.find(user_id)