app/models/post.rb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 10 AND `likes`.`user_id` = 3
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 10 AND `likes`.`id` = NULL LIMIT 1
---
  def has_liked?(user_id)
    self.likes.where(user_id:user_id).count.positive?

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 9
---
  def likes_count
    self.likes.count